erp3l/src/ChartsOfCharacteristicTypes/ВидыБюджетов/ВидыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыБюджетов</name>
  <type>
    <types>CatalogRef.СтатьиДоходовИРасходов</types>
    <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
  </type>
  <predefined>
    <items>
      <name>БюджетДвиженияДенежныхСредств</name>
      <description>Бюджет движения денежных средств</description>
      <code>БДДС</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>БюджетДоходовИРасходов</name>
      <description>Бюджет доходов и расходов</description>
      <code>БДР</code>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </items>
    <items>
      <name>БюджетДвиженияРесурсов</name>
      <description>Бюджет закупок</description>
      <code>Ресурсы</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияРесурсов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>DefinedType.Предназначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВалютнаяПоУмолчанию</name>
    <type>
      <types>EnumRef.ВариантыУстановкиПризнакаВалютнаяСтатьиБюджета</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

erp3l/src/CommonModules/СтатьиБюджетовУХПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СтатьяБюджетаПризнакВалютнаяПоУмолчанию(СтатьяБюджета) Экспорт
	
	ВидБюджета = ПолучитьВидБюджетаПоСтатье(СтатьяБюджета);
	Если Не ЗначениеЗаполнено(ВидБюджета) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Вариант = ВидБюджета.ПризнакВалютнаяПоУмолчанию;
	Если Вариант = Перечисления.ВариантыУстановкиПризнакаВалютнаяСтатьиБюджета.Да Тогда
		Возврат Истина;
	ИначеЕсли Вариант = Перечисления.ВариантыУстановкиПризнакаВалютнаяСтатьиБюджета.ПоНастройкамЛимитирования Тогда
		ПараметрыОП = ОперативноеПланированиеПовтИспУХ.ПолучитьПараметрыОперПланирования(ВидБюджета.Предназначение);
		Возврат ПараметрыОП.ИспользоватьЛимитирование;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВидБюджетаПоСтатье(СтатьяБюджета)
	
	Результат = неопределено;
	
	ВидыБюджетов = ПланыВидовХарактеристик.ВидыБюджетов;
	
	ТипСтатьи = ТипЗнч(СтатьяБюджета);
	Если ВидыБюджетов.БюджетДвиженияДенежныхСредств.ТипЗначения.Типы().Найти(ТипСтатьи) <> неопределено Тогда
		Результат = ВидыБюджетов.БюджетДвиженияДенежныхСредств;
	ИначеЕсли ВидыБюджетов.БюджетДоходовИРасходов.ТипЗначения.Типы().Найти(ТипСтатьи) <> неопределено Тогда
		Результат = ВидыБюджетов.БюджетДоходовИРасходов;
	ИначеЕсли ВидыБюджетов.БюджетДвиженияРесурсов.ТипЗначения.Типы().Найти(ТипСтатьи) <> неопределено Тогда
		Результат = ВидыБюджетов.БюджетДвиженияРесурсов;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
